<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006-2016 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: 流年 <liu21st@gmail.com>
// +----------------------------------------------------------------------


// 应用公共文件
function dd($value) {
    dump($value);
    die;
}

function returnAjax($data, $isTrue = true) {
    if($isTrue)
    {
        $returnDate = [
            'code'  =>  200,
            'data'  =>  $data,
            'static'    =>  'success'
        ];
    } else {
        $returnDate = [
            'code'  =>  500,
            'data'  =>  $data,
            'static'    =>  'errors'
        ];
    }

    echo json_encode($returnDate);
    die();
}

/**
 * 返回日志类型
 * @return string[]
 */
function logType () {
    return [
        '1'     =>  '添加员工',
        '2'     =>  '修改员工状态',
        '3'     =>  '修改密码',
        '4'     =>  '修改员工信息',
        '5'     =>  '删除员工',
        '6'     =>  '添加任务',
        '7'     =>  '修改任务状态',
        '8'     =>  '修改任务信息',
        '9'     =>  '删除任务',
        '10'    =>  '绩效评估',
        '11'    =>  '领取任务',
        '12'    =>  '修改任务的进行状态', // 比如说用户点击已完成任务
        '13'    =>  '添加权限',
        '14'    =>  '修改权限',
        '15'    =>  '删除权限',
        '16'    =>  '添加角色',
        '17'    =>  '修改角色信息',
        '18'    =>  '删除角色信息',
        '19'    =>  '用户登录'
    ];
}